Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/plf/riscv/env/handlers.c
    while(num > 0)
    {
        uint8_t val = *(uint8_t *)sp;
        for (j = 4; j >= 0; j -= 4) {
            c = ((val >> j ) & 0xF);
            if (c >= 10)
                c += 'a' - 10;
            else
                c += '0';
            log_uart_putc_noint(c);
        }


        i++;
        sp++;
        if ((i % 16) == 0) {
            log_uart_put_data((uint8_t *)"\r\n", strlen("\r\n"));
        }
        else {
            log_uart_putc_noint(',');
            log_uart_putc_noint(' ');
        }

        num--;
    }
}

void xCurrentTaskDumpInfo(unsigned long sp)
{
    int8_t j = 0;
    char *pcTaskName = sys_task_name_get(NULL);
    int32_t num = sys_current_task_stack_depth(sp);
#if (configRECORD_STACK_HIGH_ADDRESS == 0)
    log_uart_put_data((const uint8_t *)"set configRECORD_STACK_HIGH_ADDRESS=1 to get precise data\r\n",
                       strlen("set configRECORD_STACK_HIGH_ADDRESS=1 to get precise data\r\n"));
#endif

    for(j = 0; j < 100; j++)
    {
        if (pcTaskName[j] != '\0')
        {
            log_uart_putc_noint(pcTaskName[j]);
        }
        else
            break;
    }

    log_uart_put_data((uint8_t *)" Stack Dump:\r\n", strlen(" Stack Dump:\r\n"));

    dumpStackInfo(sp, num);
}

static bool parseUartCmd(char *p_buf, uint8_t buf_len, unsigned long sp) {
    uint8_t idx = 0;
    uint8_t state = 0;
    uint32_t start_addr = 0;
    uint8_t len = 0;
    int8_t i, j;
    char c;
    char cmdr[] = {'r', 'm', 'e', 'm', ' '};
    char cmdd[] = {'d', 'u', 'm', 'p'};
    char cmdh[] = {'h', 'e', 'l', 'p'};

    while(idx < buf_len) {
        switch (state) {
        case 0:
            if (p_buf[idx] == 'r' && (buf_len - idx) > 5) {
                for (i = 0; i < 5; i++) {
                    if (p_buf[idx] != cmdr[i]) {
                        return false;
                    }
                    idx++;
                }

                state = 1;
                continue;
            }
            else if (p_buf[idx] == 'd' && (buf_len - idx) >= 4) {
                for (i = 0; i < 4; i++) {
                    if (p_buf[idx] != cmdd[i]) {
                        return false;
                    }
                    idx++;
                }
                Exception_DumpFrame(sp);
                // Trap from task
                if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0) {
                    print_reg("SP     :      0x", 16, sp);
                    xCurrentTaskDumpInfo(sp);
                }
                // Trap from interrupt
                else if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0x0100) {
                    unsigned long int_sp = __RV_CSR_READ(CSR_MSCRATCH);
                    print_reg("SP     :      0x", 16, int_sp);
#ifndef __riscv_32e
                    int32_t num = 80;
#else
                    int32_t num = 64;
#endif

#ifdef __riscv_flen
                    num += 80;
#endif
                    log_uart_put_data((uint8_t *)"Interrupt Stack Dump:\r\n", strlen("Interrupt Stack Dump:\r\n"));
                    dumpStackInfo(sp, num);
                    num = (uint32_t)_sp - int_sp;
                    dumpStackInfo(int_sp, num);
                }

                log_uart_put_data((const uint8_t *)"Please use bloodhound tool to parse log above!\r\n", strlen("Please use bloodhound tool to parse log above!\r\n"));
                return true;
            }
            else if (p_buf[idx] == 'h' && (buf_len - idx) >= 4) {
                for (i = 0; i < 4; i++) {
                    if (p_buf[idx] != cmdh[i]) {
                        return false;
                    }
                    idx++;
                }
                log_uart_put_data((uint8_t *)"rmem XXXXXXXX(8 bytes Hex) DD(decimal)\r\n", strlen("rmem XXXXXXXX(8 bytes Hex) DD(decimal)\r\n"));
                log_uart_put_data((uint8_t *)"dump\r\n", strlen("dump\r\n"));

                return true;
            }
            break;
        case 1:
            if (p_buf[idx] == ' ') {
                break;
            }
            else if ((buf_len - idx) < 10) {
                return false;
            }

            for (i = 28; i >= 0; i -= 4) {
                if (p_buf[idx] >= '0' && p_buf[idx] <= '9') {
                    start_addr |= ((p_buf[idx] - '0') << i);
                }
                else if (p_buf[idx] >= 'a' && p_buf[idx] <= 'f') {
                    start_addr |= ((p_buf[idx] - 'a') + 10) << i;
                }
                else if (p_buf[idx] >= 'A' && p_buf[idx] <= 'F') {
                    start_addr |= ((p_buf[idx] - 'A') + 10) << i;
                }
                else {
                    return false;
                }
                idx++;
            }

            state = 2;
            continue;
            break;
        case 2:
            if (p_buf[idx] == ' ') {
                break;
            }

            if (p_buf[idx] >= '0' && p_buf[idx] <= '9') {
                len = len * 10 + (p_buf[idx] - '0');
            }
            else {
                return false;
            }

        default:
            break;
        }
        idx++;
    }

    // we need to check read addr is ok
    for (i = 1; i <= len; i++) {
        uint8_t val = *(uint8_t *)start_addr;
        for (j = 4; j >= 0; j -= 4) {
            c = ((val >> j ) & 0xF);
            if (c >= 10)
                c += 'a' - 10;
            else
                c += '0';
            log_uart_putc_noint(c);
        }

        start_addr++;
        if ((i % 16) == 0) {
            log_uart_put_data((uint8_t *)"\r\n", strlen("\r\n"));
        }
        else {
            log_uart_putc_noint(',');
            log_uart_putc_noint(' ');
        }
    }

    return true;
}
#endif

#if EXC_LOG_TO_FLASH
#define WR_REGION_SPAGE    ((uint32_t)0x003FE000U)       /*!< start page of write protection region: page1022 */
#define WR_REGION_EPAGE    ((uint32_t)0x003FF000U)       /*!< end page of write protection region: page1023 */

static void dump_info_2_flash(unsigned long sp)
{
    char prefix[3];
    uint32_t reg_val = 0;
    uint32_t offset = WR_REGION_SPAGE;

    if (raw_flash_erase(WR_REGION_SPAGE, FLASH_PAGE_SIZE))
        return;

