Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/plf/riscv/env/handlers.c
    prefix[0] = 20;
    prefix[1] = 0;
    prefix[2] = 0x01;   //register value
    raw_flash_write(offset, (void *)&prefix, 3);
    offset += 3;

    reg_val = __RV_CSR_READ(CSR_MCAUSE);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MDCAUSE);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MEPC);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MTVAL);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    reg_val = __RV_CSR_READ(CSR_MSUBM);
    raw_flash_write(offset, (void *)&reg_val, 4);
    offset += 4;

    prefix[2] = 0x02;   //stack type
    // Trap from task
    if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0) {
        int32_t num = sys_current_task_stack_depth(sp);
        if ((offset + num + 6) > WR_REGION_EPAGE) {
            num = WR_REGION_EPAGE - offset - 6;
        }
        prefix[0] = num & 0xFF;
        prefix[1] = (num >> 8) & 0xFF;
        raw_flash_write(offset, (void *)prefix, 3);
        offset += 3;
        raw_flash_write(offset, (void *)sp, num);
        offset += num;
    }
    // Trap from interrupt
    else if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0x0100) {
          unsigned long int_sp = __RV_CSR_READ(CSR_MSCRATCH);
          int32_t sk_num = (uint32_t)_sp - int_sp;
#ifndef __riscv_32e
        int32_t num = 80;
#else
        int32_t num = 64;
#endif

#ifdef __riscv_flen
        num += 80;
#endif

        if ((offset + num + sk_num + 6) > WR_REGION_EPAGE) {
            sk_num = WR_REGION_EPAGE - offset - 6 - num;
        }

        num += sk_num;
        prefix[0] = num & 0xFF;
        prefix[1] = (num >> 8) & 0xFF;
        raw_flash_write(offset, (void *)prefix, 3);
        offset += 3;

        num -= sk_num;
        raw_flash_write(offset, (void *)sp, num);
        offset += num;

        num = sk_num;
        raw_flash_write(offset, (void *)int_sp, num);
        offset += num;
    }

    prefix[0] = 0;
    prefix[1] = 0;
    raw_flash_write(offset, (void *)&prefix, 3);
}
#endif

/**
 * \brief      System Default Exception Handler
 * \details
 * This function provided a default exception and NMI handling code for all exception ids.
 * By default, It will just print some information for debug, Vendor can customize it according to its requirements.
 */
static void system_default_exception_handler(unsigned long mcause, unsigned long sp)
{
    /* TODO: Uncomment this if you have implement printf function */
#ifdef EXEC_USING_STD_PRINTF
    printf("MCAUSE : 0x%lx\r\n", mcause);
    printf("MDCAUSE: 0x%lx\r\n", __RV_CSR_READ(CSR_MDCAUSE));
    printf("MEPC   : 0x%lx\r\n", __RV_CSR_READ(CSR_MEPC));
    printf("MTVAL  : 0x%lx\r\n", __RV_CSR_READ(CSR_MTVAL));
#else
    char ch;
    char uart_buf[64];
    uint8_t uart_index = 0;

    log_uart_put_data((const uint8_t *)"System Default Exception \r\n", strlen("System Default Exception \r\n"));
    print_reg("MCAUSE :      0x", 16, mcause);
    print_reg("MDCAUSE:      0x", 16, __RV_CSR_READ(CSR_MDCAUSE));
    print_reg("MEPC   :      0x", 16, __RV_CSR_READ(CSR_MEPC));
    print_reg("MTVAL  :      0x", 16, __RV_CSR_READ(CSR_MTVAL));
    print_reg("MSUBM  :      0x", 16, __RV_CSR_READ(CSR_MSUBM));
#endif
    Exception_DumpFrame(sp);

#ifndef EXEC_USING_STD_PRINTF
    // Trap from task
    if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0) {
        print_reg("SP     :      0x", 16, sp);
        xCurrentTaskDumpInfo(sp);
    }
    // Trap from interrupt
    else if ((MSUBM_PTYP & __RV_CSR_READ(CSR_MSUBM)) == 0x0100) {
        unsigned long int_sp = __RV_CSR_READ(CSR_MSCRATCH);
        print_reg("SP     :      0x", 16, int_sp);
#ifndef __riscv_32e
        int32_t num = 80;
#else
        int32_t num = 64;
#endif

#ifdef __riscv_flen
        num += 84;
#endif
        log_uart_put_data((uint8_t *)"Interrupt Stack Dump:\r\n", strlen("Interrupt Stack Dump:\r\n"));
        dumpStackInfo(sp, num);
        num = (uint32_t)_sp - int_sp;
        dumpStackInfo(int_sp, num);
    }
    log_uart_put_data((const uint8_t *)"Please use bloodhound tool to parse log above!\r\n", strlen("Please use bloodhound tool to parse log above!\r\n"));

#if EXC_LOG_TO_FLASH
    dump_info_2_flash(sp);
#endif

#if (UART_CMD_IN_EXC == 1)
    uart_config(LOG_UART, DEFAULT_LOG_BAUDRATE, false, false, false);
    log_uart_put_data((const uint8_t *)"\r\n", strlen("\r\n"));
    log_uart_put_data((const uint8_t *)"print help to get cmd\r\n", strlen("print help to get cmd\r\n"));
    while (1) {
        // We should have chance to check overflow error
        // Otherwise it may cause dead loop handle rx interrupt
        if (RESET != usart_flag_get(LOG_UART, USART_FLAG_ORERR)) {
            usart_flag_clear(LOG_UART, USART_FLAG_ORERR);
        }

        if ((RESET != usart_flag_get(LOG_UART, USART_FLAG_RBNE))) {
            ch = (char)usart_data_receive(LOG_UART);
        }
        else {
            continue;
        }

        if (ch == '\r' || ch == '\n') { /* putty doesn't transmit '\n' */
            log_uart_putc_noint('\r');
            log_uart_putc_noint('\n');

            if (uart_index > 0) {
                parseUartCmd(uart_buf, uart_index, sp);
            }
            log_uart_putc_noint('#');
            log_uart_putc_noint(' ');
            uart_index = 0;
        } else if (ch == '\b') { /* non-destructive backspace */
            if (uart_index > 0) {
                uart_buf[--uart_index] = '\0';
            }
        }
        else {
            uart_buf[uart_index++] = ch;
            if (uart_index >= 64) {
                uart_index = 0;
            }
            log_uart_putc_noint(ch);
        }
    }
#endif
#endif
    while (1);
}

/**
 * \brief      NMI Handler
 * \details
 * This function provided a NMI handling code for NMI_EXCn.
 * By default, It will just print some information for debug, Vendor can customize it according to its requirements.
 */
void nmi_handler(unsigned long mcause, unsigned long sp)
{
    /* TODO: Uncomment this if you have implement printf function */
#ifdef EXEC_USING_STD_PRINTF
    printf("NMI \r\n");
    printf("MCAUSE : 0x%lx\r\n", mcause);
    printf("MDCAUSE: 0x%lx\r\n", __RV_CSR_READ(CSR_MDCAUSE));
    printf("MEPC   : 0x%lx\r\n", __RV_CSR_READ(CSR_MEPC));
    printf("MTVAL  : 0x%lx\r\n", __RV_CSR_READ(CSR_MTVAL));
#else
    log_uart_put_data((const uint8_t *)"NMI \r\n", strlen("NMI \r\n"));
    print_reg("MCAUSE :      0x", 16, mcause);
    print_reg("MDCAUSE:      0x", 16, __RV_CSR_READ(CSR_MDCAUSE));
    print_reg("MEPC   :      0x", 16, __RV_CSR_READ(CSR_MEPC));
    print_reg("MTVAL  :      0x", 16, __RV_CSR_READ(CSR_MTVAL));
    print_reg("MSUBM  :      0x", 16, __RV_CSR_READ(CSR_MSUBM));
#endif
    Exception_DumpFrame(sp);

    while (1);
}

/**
 * \brief      Initialize all the default core exception handlers
 * \details
 * The core exception handler for each exception id will be initialized to \ref system_default_exception_handler.
 * \note
 * Called in \ref _init function, used to initialize default exception handlers for all exception IDs
 */
void Exception_Init(void)
{
    for (int i = 0; i < MAX_SYSTEM_EXCEPTION_NUM + 1; i++) {
        SystemExceptionHandlers[i] = (unsigned long)system_default_exception_handler;
    }
}

/**
 * \brief       Register an exception handler for exception code EXCn
 * \details
 * * For EXCn < \ref MAX_SYSTEM_EXCEPTION_NUM, it will be registered into SystemExceptionHandlers[EXCn-1].
 * * For EXCn == NMI_EXCn, it will be registered into SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM].
 * \param   EXCn    See \ref EXCn_Type
 * \param   exc_handler     The exception handler for this exception code EXCn
 */
void Exception_Register_EXC(uint32_t EXCn, unsigned long exc_handler)
{
    if ((EXCn < MAX_SYSTEM_EXCEPTION_NUM) && (EXCn >= 0)) {
        SystemExceptionHandlers[EXCn] = exc_handler;
    } else if (EXCn == NMI_EXCn) {
        SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM] = exc_handler;
    }
}

/**
 * \brief       Get current exception handler for exception code EXCn
 * \details
 * * For EXCn < \ref MAX_SYSTEM_EXCEPTION_NUM, it will return SystemExceptionHandlers[EXCn-1].
 * * For EXCn == NMI_EXCn, it will return SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM].
 * \param   EXCn    See \ref EXCn_Type
 * \return  Current exception handler for exception code EXCn, if not found, return 0.
 */
unsigned long Exception_Get_EXC(uint32_t EXCn)
{
    if ((EXCn < MAX_SYSTEM_EXCEPTION_NUM) && (EXCn >= 0)) {
        return SystemExceptionHandlers[EXCn];
    } else if (EXCn == NMI_EXCn) {
        return SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM];
    } else {
        return 0;
    }
}

/**
 * \brief      Common NMI and Exception handler entry
 * \details
 * This function provided a command entry for NMI and exception. Silicon Vendor could modify
 * this template implementation according to requirement.
 * \remarks
 * - RISCV provided common entry for all types of exception. This is proposed code template
 *   for exception entry function, Silicon Vendor could modify the implementation.
 * - For the core_exception_handler template, we provided exception register function \ref Exception_Register_EXC
 *   which can help developer to register your exception handler for specific exception number.
 */
uint32_t core_exception_handler(unsigned long mcause, unsigned long sp)
{
    uint32_t EXCn = (uint32_t)(mcause & 0X00000fff);
    EXC_HANDLER exc_handler;

    if ((EXCn < MAX_SYSTEM_EXCEPTION_NUM) && (EXCn >= 0)) {
        exc_handler = (EXC_HANDLER)SystemExceptionHandlers[EXCn];
    } else if (EXCn == NMI_EXCn) {
        exc_handler = (EXC_HANDLER)SystemExceptionHandlers[MAX_SYSTEM_EXCEPTION_NUM];
    } else {
        exc_handler = (EXC_HANDLER)system_default_exception_handler;
    }
    if (exc_handler != NULL) {
        exc_handler(mcause, sp);
    }
    return 0;
}
/** @} */ /* End of Doxygen Group NMSIS_Core_ExceptionAndNMI */

/**
 * \brief      Dump Exception Frame
 * \details
 * This function provided feature to dump exception frame stored in stack.
 */
void Exception_DumpFrame(unsigned long sp)
{
    EXC_Frame_Type *exc_frame = (EXC_Frame_Type *)sp;
#ifndef __riscv_32e
    /* TODO: Uncomment this if you have implement printf function */
#ifdef EXEC_USING_STD_PRINTF
    printf("ra: 0x%x, tp: 0x%x, t0: 0x%x, t1: 0x%x, t2: 0x%x, t3: 0x%x, t4: 0x%x, t5: 0x%x, t6: 0x%x\n" \
           "a0: 0x%x, a1: 0x%x, a2: 0x%x, a3: 0x%x, a4: 0x%x, a5: 0x%x, a6: 0x%x, a7: 0x%x\n" \
           "mcause: 0x%x, mepc: 0x%x, msubm: 0x%x\n", exc_frame->ra, exc_frame->tp, exc_frame->t0, \
           exc_frame->t1, exc_frame->t2, exc_frame->t3, exc_frame->t4, exc_frame->t5, exc_frame->t6, \
           exc_frame->a0, exc_frame->a1, exc_frame->a2, exc_frame->a3, exc_frame->a4, exc_frame->a5, \
           exc_frame->a6, exc_frame->a7, exc_frame->mcause, exc_frame->mepc, exc_frame->msubm);
#else
    print_reg("ra     :      0x", 16, exc_frame->ra);
    print_reg("tp     :      0x", 16, exc_frame->tp);
    print_reg("t0     :      0x", 16, exc_frame->t0);
    print_reg("t1     :      0x", 16, exc_frame->t1);
    print_reg("t2     :      0x", 16, exc_frame->t1);
    print_reg("t3     :      0x", 16, exc_frame->t3);
    print_reg("t4     :      0x", 16, exc_frame->t4);
    print_reg("t5     :      0x", 16, exc_frame->t5);
    print_reg("t6     :      0x", 16, exc_frame->t6);

